Revit 2026 API

# XYZAddition Operator

---

Adds the two specified vectors and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static XYZ operator +(
	XYZ left,
	XYZ right
)
```
```vb
Public Shared Operator + (
	left As XYZ,
	right As XYZ
) As XYZ
```
```cpp
public:
static XYZ^ operator +(
	XYZ^ left,
	XYZ^ right
)
```
```fsharp
static let inline (+)
        left : XYZ *
        right : XYZ  : XYZ
```

#### Parameters

left XYZ
    The first vector.
right XYZ
    The second vector.

#### Return Value

XYZThe vector equal to the sum of the two source vectors.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when left or right is . |

The added vector is obtained by adding each coordinate of the right vector to the corresponding coordinate of the left vector.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace